In [2]:
### PANDAS

In [8]:
import pandas as pd
[f'Test {i}' for i in range (1,4)]

['Test 1', 'Test 2', 'Test 3']

In [12]:
# pd.Dataframe таблица в pandas
pd.DataFrame(index = ['Петя', 'Вася'], columns = [f'Test {i}' for i in range (1,4)]) # Формируем 3 строки через list comprehenshion

     Test 1 Test 2 Test 3
Петя    NaN    NaN    NaN
Вася    NaN    NaN    NaN

In [14]:
# cписок списков
grades = [[6, 7, 8,], [8, 6, 5]]
pd.DataFrame(grades)

   0  1  2
0  6  7  8
1  8  6  5

In [15]:
pd.DataFrame(grades, index = ['Петя', 'Вася'], columns = [f'Test {i}' for i in range (1,4)])

      Test 1  Test 2  Test 3
Петя       6       7       8
Вася       8       6       5

In [16]:
# cоздаем из словаря, на месте ключей - названия колонок.
grades = {'Test 1': [6, 8],
         'Test 2': [7, 6],
         'Test 3': [8, 5]}
pd.DataFrame(grades, index = ['Петя', 'Вася'])

      Test 1  Test 2  Test 3
Петя       6       7       8
Вася       8       6       5

In [ ]:
# импорт данных
pd.read_csv()

In [17]:
df = pd.DataFrame(grades, index = ['Петя', 'Вася'])
df.loc['Вася', 'Test 3']

5

In [18]:
df.iloc[1, 2]    # iloc работает не с элементами, а с индексами, как если бы не было названий

5

In [19]:
df.loc['Вася', 'Test 2':'Test 3'] # ceries

Test 2    6
Test 3    5
Name: Вася, dtype: int64

In [20]:
df.loc['Вася', ['Test 2', 'Test 3']]

Test 2    6
Test 3    5
Name: Вася, dtype: int64

In [23]:
grades_empty = pd.DataFrame(index = ['Петя', 'Вася'], columns = [f'Test {i}' for i in range (1,4)])
grades_empty

     Test 1 Test 2 Test 3
Петя    NaN    NaN    NaN
Вася    NaN    NaN    NaN

In [24]:
grades_empty.loc['Петя', 'Test 1'] = 6
grades_empty

     Test 1 Test 2 Test 3
Петя      6    NaN    NaN
Вася    NaN    NaN    NaN

In [25]:
grades_empty.loc['Петя'] = [6,7,8]
grades_empty

     Test 1 Test 2 Test 3
Петя      6      7      8
Вася    NaN    NaN    NaN

In [26]:
grades_empty[['Test 1', 'Test 2']]

     Test 1 Test 2
Петя      6      7
Вася    NaN    NaN

In [27]:
grades_empty.columns

Index(['Test 1', 'Test 2', 'Test 3'], dtype='object')

In [29]:
df.loc['Cаша'] = [6, 8, 4]
df

      Test 1  Test 2  Test 3
Петя       6       7       8
Вася       8       6       5
Cаша       6       8       4

In [30]:
df['Test 3'] < 6

Петя    False
Вася     True
Cаша     True
Name: Test 3, dtype: bool

In [31]:
df[df['Test 3'] < 6]

      Test 1  Test 2  Test 3
Вася       8       6       5
Cаша       6       8       4

In [32]:
df[df['Test 3'] < 6]['Test 2']['Вася']

6

In [33]:
df[(df['Test 3'] < 6) & (df['Test 2'] > 7)]

      Test 1  Test 2  Test 3
Cаша       6       8       4

In [34]:
df['Test 1'] + df['Test 2']

Петя    13
Вася    14
Cаша    14
dtype: int64

In [37]:
df['Test mean'] = (df['Test 1'] + df['Test 2'] + df['Test 3'])/3
df

      Test 1  Test 2  Test 3  Test mean
Петя       6       7       8   7.000000
Вася       8       6       5   6.333333
Cаша       6       8       4   6.000000

In [ ]:
df.mean() #.median(), .sum(), .abs(), .max()

In [39]:
df.mean(axis = 1) #по строкам

Петя    7.000000
Вася    6.333333
Cаша    6.000000
dtype: float64

In [40]:
df.describe()

         Test 1  Test 2    Test 3  Test mean
count  3.000000     3.0  3.000000   3.000000
mean   6.666667     7.0  5.666667   6.444444
std    1.154701     1.0  2.081666   0.509175
min    6.000000     6.0  4.000000   6.000000
25%    6.000000     6.5  4.500000   6.166667
50%    6.000000     7.0  5.000000   6.333333
75%    7.000000     7.5  6.500000   6.666667
max    8.000000     8.0  8.000000   7.000000

In [41]:
df['Test 1'].value_counts()

6    2
8    1
Name: Test 1, dtype: int64

In [43]:
df['Gender'] = ['m', 'm', 'f']
df

      Test 1  Test 2  Test 3  Test mean Gender
Петя       6       7       8   7.000000      m
Вася       8       6       5   6.333333      m
Cаша       6       8       4   6.000000      f

In [44]:
df['Gender'].value_counts(normalize=True)

m    0.666667
f    0.333333
Name: Gender, dtype: float64

In [45]:
df.loc['Cаша', 'Final'] = 7
df

      Test 1  Test 2  Test 3  Test mean Gender  Final
Петя       6       7       8   7.000000      m    NaN
Вася       8       6       5   6.333333      m    NaN
Cаша       6       8       4   6.000000      f    7.0

In [46]:
df.isna()

      Test 1  Test 2  Test 3  Test mean  Gender  Final
Петя   False   False   False      False   False   True
Вася   False   False   False      False   False   True
Cаша   False   False   False      False   False  False

In [48]:
df.isna().sum().sum()

2

In [49]:
df.isna().sum().sum

<bound method Series.sum of Test 1       0
Test 2       0
Test 3       0
Test mean    0
Gender       0
Final        2
dtype: int64>

In [50]:
df.isna().sum(axis = 1)

Петя    1
Вася    1
Cаша    0
dtype: int64

In [54]:
def recode(gender):
    if gender == 'm':
        return 1
    elif gender == 'f':
        return 2

df['Gender_Code'] = df['Gender'].apply(recode)
df

      Test 1  Test 2  Test 3  Test mean Gender  Final  Gender_Code
Петя       6       7       8   7.000000      m    NaN            1
Вася       8       6       5   6.333333      m    NaN            1
Cаша       6       8       4   6.000000      f    7.0            2